In [1]:
    people = {
        "first": ["jay", "Jane","John"],
        "last" : ["murali","doe","doe"],
        "email": ["jaymurali@email.com","janedoe@email.com","johndoe@email.com"]
    }

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first    last                email
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  John     doe    johndoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = [x.upper() for x in df.columns]

In [7]:
df

  FIRST    LAST                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  John     doe    johndoe@email.com

In [8]:
df.rename(columns={'FIRST': 'name','LAST': 'surname'},inplace=True)
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  John     doe    johndoe@email.com

In [9]:
df.loc[2]

name                    John
surname                  doe
EMAIL      johndoe@email.com
Name: 2, dtype: object

In [10]:
df.loc[2]=['john','smith','johnsmith@email.com']

In [11]:
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  john   smith  johnsmith@email.com

In [12]:
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  john   smith  johnsmith@email.com

In [13]:
df.loc[2,['surname','EMAIL']] = ['doe','johndoe@email.com']

In [14]:
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  john     doe    johndoe@email.com

In [15]:
df.loc[2,'surname']= 'smith'

In [16]:
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  john   smith    johndoe@email.com

In [17]:
df.at[2,'surname']= 'doe'

In [18]:
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  john     doe    johndoe@email.com

In [19]:
filt = (df['EMAIL']=='johndoe@email.com')

In [20]:
df.loc[filt]['surname']

2    doe
Name: surname, dtype: object

In [21]:
df.loc[filt,["surname"]]='smith'

In [22]:
df

   name surname                EMAIL
0   jay  murali  jaymurali@email.com
1  Jane     doe    janedoe@email.com
2  john   smith    johndoe@email.com

In [23]:
df['EMAIL']=df['EMAIL'].str.upper()

In [24]:
df

   name surname                EMAIL
0   jay  murali  JAYMURALI@EMAIL.COM
1  Jane     doe    JANEDOE@EMAIL.COM
2  john   smith    JOHNDOE@EMAIL.COM

In [25]:
df['EMAIL'].apply(len)

0    19
1    17
2    17
Name: EMAIL, dtype: int64

In [26]:
def updateemail(email):
    return email.lower()

In [27]:
 updateemail(df.loc[2,'EMAIL'])

'johndoe@email.com'

In [28]:
df['EMAIL'].apply(updateemail)

0    jaymurali@email.com
1      janedoe@email.com
2      johndoe@email.com
Name: EMAIL, dtype: object

In [29]:
df.apply(len)

name       3
surname    3
EMAIL      3
dtype: int64

In [30]:
df.apply(len,axis='columns')

0    3
1    3
2    3
dtype: int64

In [31]:
df.apply(min)

name                    Jane
surname                  doe
EMAIL      JANEDOE@EMAIL.COM
dtype: object

In [32]:
df.apply(min,axis='columns')

0    JAYMURALI@EMAIL.COM
1      JANEDOE@EMAIL.COM
2      JOHNDOE@EMAIL.COM
dtype: object

In [33]:
df.applymap(len)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_13132\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   name  surname  EMAIL
0     3        6     19
1     4        3     17
2     4        5     17

In [34]:
df.applymap(str.upper)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_13132\382839591.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.upper)

   name surname                EMAIL
0   JAY  MURALI  JAYMURALI@EMAIL.COM
1  JANE     DOE    JANEDOE@EMAIL.COM
2  JOHN   SMITH    JOHNDOE@EMAIL.COM

In [35]:
df['name']=df['name'].replace({'jay':'chris','Jane':'liangelo'})

In [36]:
df

       name surname                EMAIL
0     chris  murali  JAYMURALI@EMAIL.COM
1  liangelo     doe    JANEDOE@EMAIL.COM
2      john   smith    JOHNDOE@EMAIL.COM

In [38]:
df['fullname']=df['name'] + ' ' + df['surname']

In [41]:
df.drop(columns=['name','surname'], inplace=True)

In [45]:
df['fullname'].str.split(' ',expand=True)

          0       1
0     chris  murali
1  liangelo     doe
2      john   smith

In [46]:
df[['first','last']]=df['fullname'].str.split(' ',expand=True)

In [47]:
df

                 EMAIL      fullname     first    last
0  JAYMURALI@EMAIL.COM  chris murali     chris  murali
1    JANEDOE@EMAIL.COM  liangelo doe  liangelo     doe
2    JOHNDOE@EMAIL.COM    john smith      john   smith